In [1]:
import pymysql

In [2]:
db=pymysql.connect("localhost",'root','root','demo')

In [3]:
import pandas as pd

In [7]:
df=pd.read_sql_query('select * from login',con=db)

In [8]:
df

                  Email     password
0           k@gmail.com         1233
1  rishank887@gmail.com  22214244242
2    sbhanu94@gmail.com   9988582271
3  sbhanu0002@gmail.com   9988582271

In [9]:
cursor=db.cursor()

In [10]:
cursor.execute('select version()')

1

In [21]:
sql="""create table test(Name char(20),
              Age INT)"""

In [22]:
cursor.execute(sql)

0

In [23]:
db.commit()

In [24]:
df=pd.read_sql_query('select * from login',con=db)

In [25]:
df

                  Email     password
0           k@gmail.com         1233
1  rishank887@gmail.com  22214244242
2    sbhanu94@gmail.com   9988582271
3  sbhanu0002@gmail.com   9988582271

In [26]:
sql="""insert into test values("bhanu",12)
                               ,("sharma",23)"""

In [27]:
cursor.execute(sql)

2

In [28]:
db.commit()

In [29]:
df=pd.read_sql_query("select * from test",con=db)

In [30]:
df

     Name  Age
0   bhanu   12
1  sharma   23

In [31]:
df.to_csv("test.csv")

In [32]:
df

     Name  Age
0   bhanu   12
1  sharma   23

In [33]:
import os

In [34]:
print(os.getcwd())

C:\Users\HP\Data analytics

In [35]:
import pandas as pd

In [36]:
df1=pd.DataFrame({'item':['A','B','C','D'],
                   'value':[1,2,3,4]})

In [37]:
df1

  item  value
0    A      1
1    B      2
2    C      3
3    D      4

In [39]:
df2=pd.DataFrame({'item':['E','F','G','H'],
                  'value':[5,6,7,8]})

In [40]:
df2

  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [42]:
pd.concat([df1,df2],ignore_index=True)

  item  value
0    A      1
1    B      2
2    C      3
3    D      4
4    E      5
5    F      6
6    G      7
7    H      8

In [43]:
df3=pd.DataFrame({'item':['E','F','G','H'],
                   'quantity':[3,4,5,6]})

In [44]:
pd.concat([df1,df3])

E:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  item  quantity  value
0    A       NaN    1.0
1    B       NaN    2.0
2    C       NaN    3.0
3    D       NaN    4.0
0    E       3.0    NaN
1    F       4.0    NaN
2    G       5.0    NaN
3    H       6.0    NaN

In [45]:
df4=pd.DataFrame({'item':['D','E','F','G'],
                   'quqntity':[2,3,4,5]})

In [47]:
pd.concat([df1,df4]).reset_index()

E:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   index item  quqntity  value
0      0    A       NaN    1.0
1      1    B       NaN    2.0
2      2    C       NaN    3.0
3      3    D       NaN    4.0
4      0    D       2.0    NaN
5      1    E       3.0    NaN
6      2    F       4.0    NaN
7      3    G       5.0    NaN

In [50]:
pd.concat([df1,df3],axis=1)

  item  value item  quantity
0    A      1    E         3
1    B      2    F         4
2    C      3    G         5
3    D      4    H         6

In [51]:
df1.append([df2,df3])

E:\anaconda\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

  item  quantity  value
0    A       NaN    1.0
1    B       NaN    2.0
2    C       NaN    3.0
3    D       NaN    4.0
0    E       NaN    5.0
1    F       NaN    6.0
2    G       NaN    7.0
3    H       NaN    8.0
0    E       3.0    NaN
1    F       4.0    NaN
2    G       5.0    NaN
3    H       6.0    NaN

In [ ]:
df1.append([df2,df3],ignore_index)